FoamProject/blockMeshVortexShedding/freeStream/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          254;
        startFace       277830;
    }
    outlet
    {
        type            patch;
        nFaces          254;
        startFace       278084;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          553;
        startFace       278338;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          553;
        startFace       278891;
    }
    leadingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       279444;
    }
    trailingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       279456;
    }
    upperSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          91;
        startFace       279468;
    }
    lowerSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          91;
        startFace       279559;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          278740;
        startFace       279650;
    }
)

// ************************************************************************* //
